Documents/ДвижениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>&#x0414;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0435;&#x0422;&#x043E;&#x0432;&#x0430;&#x0440;&#x043E;&#x0432;</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.&#x041D;&#x043E;&#x043C;&#x0435;&#x043D;&#x043A;&#x043B;&#x0430;&#x0442;&#x0443;&#x0440;&#x0430;</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.&#x0425;&#x0430;&#x0440;&#x0430;&#x043A;&#x0442;&#x0435;&#x0440;&#x0438;&#x0441;&#x0442;&#x0438;&#x043A;&#x0438;</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ДвижениеТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ТекстОшибкиПроведения;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ТекстОшибкиПроведения = "";

	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		Отказ = Истина;
		ТекстОшибкиПроведения = "Не заполнен вид операции документа.";
		ВызватьИсключение ТекстОшибкиПроведения;
	КонецЕсли;

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();

	Если ВидОперации = Перечисления.ВидыОперацийТоваров.Расход Тогда
		Если Не ПроверитьОстаткиДляРасхода() Тогда
			Отказ = Истина;
			ВызватьИсключение ТекстОшибкиПроведения;
		КонецЕсли;
	КонецЕсли;

	Для Каждого СтрокаТовара Из Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.Количество) Или СтрокаТовара.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ПолучитьВидДвижения();
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.Характеристика = СтрокаТовара.Характеристика;
		Движение.Количество = СтрокаТовара.Количество;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВидДвижения()

	Если ВидОперации = Перечисления.ВидыОперацийТоваров.Приход Тогда
		Возврат ВидДвиженияНакопления.Приход;
	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийТоваров.Расход Тогда
		Возврат ВидДвиженияНакопления.Расход;
	КонецЕсли;

	ВызватьИсключение "Неизвестный вид операции документа.";

КонецФункции

Функция ПроверитьОстаткиДляРасхода()

	ТаблицаРасхода = СформироватьТаблицуРасхода();
	Если ТаблицаРасхода.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	КонтрольПройден = Истина;
	МассивОшибок = Новый Массив;

	Для Каждого СтрокаРасхода Из ТаблицаРасхода Цикл
		КоличествоОстаток = ПолучитьОстатокПоДвижениям(
			СтрокаРасхода.Номенклатура,
			СтрокаРасхода.Характеристика);

		Если КоличествоОстаток < СтрокаРасхода.Количество Тогда
			КонтрольПройден = Ложь;
			МассивОшибок.Добавить(СтрШаблон(
				"Недостаточно остатка по номенклатуре %1, характеристика %2. Требуется %3, доступно %4.",
				СтрокаРасхода.Номенклатура,
				ПолучитьПредставлениеХарактеристики(СтрокаРасхода.Характеристика),
				Формат(СтрокаРасхода.Количество, "ЧГ=15.3"),
				Формат(КоличествоОстаток, "ЧГ=15.3")));
		КонецЕсли;
	КонецЦикла;

	Если Не КонтрольПройден Тогда
		ТекстОшибкиПроведения = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;

	Возврат КонтрольПройден;

КонецФункции

Функция СформироватьТаблицуРасхода()

	ТаблицаРасхода = Новый ТаблицаЗначений;
	ТаблицаРасхода.Колонки.Добавить("Номенклатура");
	ТаблицаРасхода.Колонки.Добавить("Характеристика");
	ТаблицаРасхода.Колонки.Добавить("Количество");

	Для Каждого СтрокаТовара Из Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТовара.Количество) Или СтрокаТовара.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаРасхода.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТовара.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаТовара.Характеристика;
		НоваяСтрока.Количество = СтрокаТовара.Количество;
	КонецЦикла;

	ТаблицаРасхода.Свернуть("Номенклатура, Характеристика", "Количество");
	Возврат ТаблицаРасхода;

КонецФункции

Функция ПолучитьОстатокПоДвижениям(Номенклатура, Характеристика)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(
	|		СУММА(
	|			ВЫБОР
	|				КОГДА ДвиженияТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ДвиженияТоваров.Количество
	|				ИНАЧЕ -ДвиженияТоваров.Количество
	|			КОНЕЦ), 0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров КАК ДвиженияТоваров
	|ГДЕ
	|	ДвиженияТоваров.Период <= &МоментВремени
	|	И ДвиженияТоваров.Номенклатура = &Номенклатура
	|	И ДвиженияТоваров.Характеристика = &Характеристика
	|	И ДвиженияТоваров.Регистратор <> &Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ПолучитьПредставлениеХарактеристики(Характеристика)

	Если ЗначениеЗаполнено(Характеристика) Тогда
		Возврат Характеристика;
	КонецЕсли;

	Возврат "без характеристики";

КонецФункции

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
